RedditClone/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        @user = User.find_by(id: params[:id])

        if @user == current_user
            @user.destroy