RedditClone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "0TN-BRKZDZpWc8B6WGXLgQ"], ["updated_at", "2021-09-24 21:08:06.454926"], ["id", 1]]